Repository: nickky2010/Labor_Protection_v.2.0
Catalog: BLL/Resources/SharedResource.*.resx
Languages: ru

# AfterAddEmployeeNotFound
source: Employee after add not found!
ru: Сотрудник после добавления не найден!

source: After add position not found
ru: Должность (профессия) после добавления не найдена!

# AfterAddRoleNotFound
source: Role after add not found!
ru: Роль после добавления не найдена!

# AfterAddUserNotFound
source: User after add not found!
ru: Пользователь после добавления не найден!

# ContentPathNotFound
source: Folder for content not found.
ru: Папка для фотографий не найдена.

# CountItemsLeastOne
source: Count items must be at least 1.
ru: Количество элементов должно быть не менее 1.

# CreatingWithRoleIsProhibited
source: Сreating a user with current role is prohibited!
ru: Создание пользователя с текущей ролью запрешено!

# DataIsNotValid
source: Data for item is not valid!
ru: Данные для элемента не являются валидными!

# DataNotDeletedFromDB
source: Data has not been deleted from the database!
ru: Данные не были удалены из базы данных!

# DataNotUpdatedInDB
source: Data has not been updated in the database!
ru: Данные не были обновлены в базе данных

# DataNotWrittenToDB
source: Data was not written to the database!
ru: Данные не были записаны в базу данных!

source: Date of issue
ru: Дата выдачи

# DriverCategoriesNotFound
source: Driver categories (category) not found
ru: Водительские категории(категория) не найдены

# DriverCategoryAlreadyExist
source: Driver category already exist in database!
ru: Водительская категория уже существует в базе данных.

source: Driver category not found!
ru: Водительская категория не найдена в базе данных

source: Driver license
ru: Водительское удостоверение

# DriverLicenseAlreadyExist
source: Driver license already exist in database!
ru: Водительское удостоверение уже существует в базе данных.

source: Driver license not found!
ru: Водительское удостоверение не найдено в базе данных.

# DriverLicensePhotoAlreadyExist
source: Driver license photo already exist in database!
ru: Фотография водительского удостоверения уже существует в базе данных.

source: Driver license photo not found!
ru: Фотография водительского удостоверения не найдена в базе данных

source: Driver license photos
ru: Фотографии водительского удостоверения

source: Driver license photos not found!
ru: Фотографии водительских удостоверений не найдены в базе данных

source: Driver licenses not found!
ru: Водительские удостоверения не найдены в базе данных.

source: Driver medical certificate
ru: Медицинская справка водителя

# DriverMedicalCertificateAlreadyExist
source: Driver medical certificate exist in database!
ru: Медицинская справка водителя уже существует в базе данных!

source: Driver medical certificate not found!
ru: Медицинская справка водителя не найдена!

# DriverMedicalCertificatePhotoAlreadyExist
source: Driver medical certificate photo already exist in database!
ru: Фотография медицинской справки водителя уже существует в базе данных.

source: Driver medical certificate photo not found!
ru: Фотография медицинской справки водителя не найдена в базе данных.

source: Driver medical certificate photos
ru: Фотографии водительской медицинской справки

# DriverMedicalCertificatePhotosNotFound
source: Driver medical certificates photo not found!
ru: Фотографии медицинских справок водителей не найдены в базе данных.

source: Driver medical certificates not found!
ru: Медицинские справки водителей не найдены!

# EmployeeAlreadyExist
source: Employee already exist in database!
ru: Сотрудник уже существует в базе данных.

# EmployeeFoundAfterDelete
source: Failed to delete employee from database
ru: Удалить сотрудника из базы данных не удалось

source: Employee not found!
ru: Сотрудник не найден в базе данных

source: Employees not found!
ru: Сотрудники не найдены!

source: Enter date of issue
ru: Введите дату выдачи

# EnterDriverLicensePhotos
source: Load driver license photos
ru: Загрузите фотографии водительского удостоверения

# EnterDriverMedicalCertificatePhotos
source: Load driver medical certificate photos
ru: Загрузите фотографии водительской медицинской справки

source: Enter expiry date
ru: Введите срок действия

source: Enter firstname
ru: Введите имя

source: Enter patronymic
ru: Введите отчество

source: Enter position
ru: Введите должность (профессию)

source: Enter serial number
ru: Введите серийный номер

source: Enter surname
ru: Введите фамилию.

source: Expiry date
ru: Срок действия

source: FirstName
ru: Имя

# InvalidLoginAndOrPassword
source: User not found! Invalid login and / or password intered.
ru: Пользователь не найден! Возможно был введен неверный логин и(или) пароль.

# InvalidRoleName
source: Role not found! Invalid role name intered.
ru: Роль не найдена! Введено неверное имя роли.

# LoginAlreadyExists
source: User with current login already exists!
ru: Пользователь с таким логином уже существует!

# NoData
source: No data for item!
ru: Нет данных для элемента!

source: No photo
ru: Нет фотографии

# OpenCategories
source: Open driver categories
ru: Открытые водительские категории

source: Patronymic
ru: Отчество

source: Photo file already exist.
ru: Фотография уже существует в папке.

# PhotoFileWithIdNotFound
source: Photo file not found in folder. Name of photo file:
ru: Фотография не найдена в папке. Название фотографии:

source: Position
ru: Должность (профессия)

# PositionAlreadyExist
source: Position already exist in database!
ru: Должность (профессия) уже существует в базе данных.

# PositionFoundAfterDelete
source: Failed to delete position from database
ru: Удалить должность (профессию) из базы данных не удалось.

source: Position not found!
ru: Должность (профессия) не найдена в базе данных

source: Positions not found!
ru: Должности (профессии) не найдены в базе данных

# RecordToEditWasModifiedAnotherUser
source: The record you attempted to edit was modified by another user after you got the original value. The edit operation was canceled and the current values in the database have been displayed. If you still want to edit this record, try begin again.
ru: Запись, которую вы пытались редактировать, была изменена другим пользователем после того, как вы получили исходное значение. Операция редактирования была отменена, и были показаны текущие значения в базе данных. Если вы все еще хотите редактировать эту запись, попробуйте начать заново.

# RoleAlreadyExists
source: Role with current name already exists!
ru: Роль с таким именем уже существует!

# RoleNotFound
source: Role with current name not found! Perhaps such a role does not exist.
ru: Роль с текущим названием не найдена! Возможно такой роли не существует.

source: Serial number
ru: Серийный номер

# StartItemNotExist
source: Current start item does not exist.
ru: Стартовая позиция с переданным номером не существует.

source: Surname
ru: Фамилия

# ValidateFirstName
source: The firstname must begin with a capital letter and be no more than 30 characters.
ru: Имя должно начинаться с заглавной буквы и быть не более 30 символов.

# ValidatePatronymic
source: The patronymic must begin with a capital letter and be no more than 30 characters.
ru: Отчество должно начинаться с заглавной буквы и быть не более 30 символов.

# ValidatePosition
source: The position must begin with a capital letter and be no more than 30 characters.
ru: Название должности (профессии) должно начинаться с заглавной буквы и быть не более 30 символов.

# ValidateSurname
source: The surname must begin with a capital letter and be no more than 30 characters.
ru: Фамилия должна начинаться с заглавной буквы и быть не более 30 символов.
